namespace NewLife.JT808.UtilTool
{
    /// <summary>终端参数</summary>
    public enum ParameterKinds : uint
    {
        心跳间隔 = 0x0001,
        Tcp超时 = 0x0002,
        Tcp重传 = 0x0003,
        Udp超时 = 0x0004,
        Udp重传 = 0x0005,
        Sms超时 = 0x0006,
        Sms重传 = 0x0007,

        主APN = 0x0010,
        主用户名 = 0x0011,
        主密码 = 0x0012,
        主地址 = 0x0013,

        备APN = 0x0014,
        备用户名 = 0x0015,
        备密码 = 0x0016,
        备地址 = 0x0017,
        Tcp端口 = 0x0018,
        Udp端口 = 0x0019,

        IC卡主服务器 = 0x001A,
        IC卡Tcp = 0x001B,
        IC卡Udp = 0x001C,
        IC卡备服务器 = 0x001D,

        /// <summary>0定时汇报，1定距汇报，2定时和定距汇报</summary>
        位置汇报策略 = 0x0020,
        /// <summary>0根据ACC状态，1根据登录状态和ACC状态</summary>
        位置汇报方案 = 0x0021,

        驾驶员未登录汇报间隔 = 0x0022,

        从APN = 0x0023,
        从用户名 = 0x0024,
        从密码 = 0x0025,
        从地址 = 0x0026,

        休眠汇报间隔 = 0x0027,
        报警汇报间隔 = 0x0028,
        缺省汇报间隔 = 0x0029,

        缺省汇报距离 = 0x002C,
        驾驶员未登录汇报距离 = 0x002D,
        休眠汇报距离 = 0x002E,
        报警汇报距离 = 0x002F,

        拐点补传角度 = 0x0030,
        电子围栏半径 = 0x0031,
        违规行驶时段 = 0x0032,

        监控平台电话 = 0x0040,
        终端复位电话 = 0x0041,
        恢复出厂电话 = 0x0042,
        监控平台SMS号码 = 0x0043,
        文本报警SMS号码 = 0x0044,
        终端接听策略 = 0x0045,
        每次最长通话 = 0x0046,
        当月最长通话 = 0x0047,
        监听电话号码 = 0x0048,
        监管平台特权短信号码 = 0x0049,

        报警屏蔽字 = 0x0050,
        报警SMS开关 = 0x0051,
        报警拍照开关 = 0x0052,
        报警拍照存储 = 0x0053,
        关键标志 = 0x0054,

        最高速度 = 0x0055,
        超速持续时间 = 0x0056,
        连续驾驶时间 = 0x0057,
        当天累计驾驶时间 = 0x0058,
        最小休息时间 = 0x0059,
        最长停车时间 = 0x005A,
        超速预警差值 = 0x005B,
        疲劳预警差值 = 0x005C,
        碰撞报警参数 = 0x005D,
        侧翻报警参数 = 0x005E,

        定时拍照控制 = 0x0064,
        定距拍照控制 = 0x0065,

        图像质量 = 0x0070,
        亮度 = 0x0071,
        对比度 = 0x0072,
        饱和度 = 0x0073,
        色度 = 0x0074,

        #region JT1078
        音视频参数 = 0x0075,
        音视频通道列表 = 0x0076,
        单独视频通道 = 0x0077,
        特殊报警录像 = 0x0079,
        视频报警屏蔽字 = 0x007A,
        图像分析报警 = 0x007B,
        终端休眠唤醒模式 = 0x007C,
        #endregion

        里程 = 0x0080,
        省份 = 0x0081,
        城市 = 0x0082,
        号牌 = 0x0083,
        颜色 = 0x0084,

        GNSS模式 = 0x0090,
        GNSS波特率 = 0x0091,
        GNSS输出频率 = 0x0092,
        GNSS采集频率 = 0x0093,
        GNSS上传方式 = 0x0094,
        GNSS上传设置 = 0x0095,

        CAN1采集间隔 = 0x0100,
        CAN1上传间隔 = 0x0101,
        CAN2采集间隔 = 0x0102,
        CAN2上传间隔 = 0x0103,
        CAN总线ID = 0x0110,
    }
}